[
    {
        "query": "I just imported a new list of 500 leads. Before I add them to my main campaign list, I need you to clean it. Please run a bulk validation on these emails to check for invalid syntax, disposable domains, and spam traps. For any emails that come back as invalid, remove them from the 'New Leads 2025' mailing list in my MailGun account.",
        "tool list": [
            {
                "tool name": "Blaze Verify: Verify a batch of emails",
                "tool description": "Verifies a batch of emails provided as a comma-separated parameter, supporting up to 1,000 emails per batch. This endpoint integrates with Emailable's email verification service, which offers reliable and affordable list cleaning to help marketers and developers maintain accurate contact data. The results can be delivered via HTTP POST to a specified URL, and using a test key returns a success response along with an example batch ID for testing purposes.",
                "required parameters": [
                    {
                        "name": "emails",
                        "value": "user_lead_1@example.com,user_lead_2@example.com,user_lead_3@example.com,..."
                    }
                ],
                "optional parameters": []
            },
            {
                "tool name": "MailGun: deleteMember",
                "tool description": "Deletes a mailing list member by their email address or ID. This is part of a comprehensive email management system that sends, validates, receives, and tracks emails, utilizing a database of subscribed contacts to ensure accurate list maintenance and enhance communication efficiency.",
                "required parameters": [
                    {
                        "name": "address",
                        "value": "New Leads 2025@<your_mailgun_domain>"
                    },
                    {
                        "name": "apiKey",
                        "value": "your_mailgun_api_key"
                    },
                    {
                        "name": "memberAddress",
                        "value": "invalid_email_from_blaze_verify@example.com"
                    }
                ],
                "optional parameters": []
            }
        ],
        "query_simple_gemini-2.5-pro": "Please verify the following list of emails: 'user_lead_1@example.com,invalid_email@example.com,user_lead_3@example.com'. Subsequently, remove any emails identified as invalid from the 'New Leads 2025@<your_mailgun_domain>' mailing list.",
        "query_hard_gemini-2.5-pro": "I need to do a little list maintenance. Can you please check the validity of these four email addresses: user_lead_1@example.com, user_lead_2@example.com, user_lead_3@example.com, and invalid_email_from_blaze_verify@example.com. Afterwards, any addresses that turn out to be invalid should be removed from my 'New Leads 2025' mailing list.",
        "query_simple_claude_v37": "Verify a batch of email addresses using Blaze Verify, then remove any invalid email addresses from a MailGun mailing list called 'New Leads 2025'",
        "query_hard_claude_v37": "I need to clean up my email marketing list by verifying these addresses: user_lead_1@example.com, user_lead_2@example.com, user_lead_3@example.com, and then remove any invalid ones from my 'New Leads 2025' mailing list on MailGun."
    },
    {
        "query": "It's time to send our monthly newsletter. Please use the 'July Newsletter' template in my Mailjet account and send it to my 'Subscribers' contact list. After it has been sent, I want to know how it's performing. Please retrieve the open and click statistics for this campaign.",
        "tool list": [
            {
                "tool name": "Mailjet: getTemplatesList",
                "tool description": "Lists available email template resources associated with a specific API key. This endpoint is part of a comprehensive solution designed to manage transactional email workflows, enabling users to customize and deploy templates efficiently for personalized communication at scale.",
                "required parameters": [
                    {
                        "name": "apiKeyPrivate",
                        "value": "your_mailjet_api_key_private"
                    },
                    {
                        "name": "apiKeyPublic",
                        "value": "your_mailjet_api_key_public"
                    }
                ],
                "optional parameters": []
            },
            {
                "tool name": "Mailjet: getContactList",
                "tool description": "Lists contact resources associated with the provided API key. This endpoint is part of a comprehensive solution for managing transactional email workflows, leveraging API infrastructure to access a centralized contact database. It enables efficient handling of email recipients by retrieving structured contact data, ensuring seamless integration with email sending and tracking functionalities within the platform.",
                "required parameters": [
                    {
                        "name": "apiKeyPrivate",
                        "value": "your_mailjet_api_key_private"
                    },
                    {
                        "name": "apiKeyPublic",
                        "value": "your_mailjet_api_key_public"
                    }
                ],
                "optional parameters": []
            },
            {
                "tool name": "Mailjet: createNewsLetter",
                "tool description": "Adds a new newsletter resource to the transactional email system. This endpoint integrates with a comprehensive platform designed to power transactional emails, enabling the seamless inclusion of personalized newsletters to enhance user engagement and streamline communication workflows.",
                "required parameters": [
                    {
                        "name": "apiKeyPrivate",
                        "value": "your_mailjet_api_key_private"
                    },
                    {
                        "name": "apiKeyPublic",
                        "value": "your_mailjet_api_key_public"
                    },
                    {
                        "name": "data",
                        "value": "{\"Title\": \"July Newsletter Campaign\", \"Subject\": \"July Newsletter\", \"ContactsListID\": {{ID of 'Subscribers' contact list from the previous step}}, \"TemplateID\": {{ID of 'July Newsletter' template from the previous step}}, \"Locale\": \"en_US\"}"
                    }
                ],
                "optional parameters": []
            },
            {
                "tool name": "Mailjet: createNewsLetterScheduled",
                "tool description": "Schedules newsletter delivery at a specified time and frequency. This endpoint is part of a comprehensive transactional email platform that automates and optimizes email campaigns, ensuring timely and reliable communication with users. By integrating advanced scheduling algorithms, it enables seamless coordination of email workflows, enhancing efficiency in managing automated messages and improving user engagement through precise timing.",
                "required parameters": [
                    {
                        "name": "apiKeyPrivate",
                        "value": "your_mailjet_api_key_private"
                    },
                    {
                        "name": "apiKeyPublic",
                        "value": "your_mailjet_api_key_public"
                    },
                    {
                        "name": "id",
                        "value": "{{Newsletter ID from the previous step}}"
                    },
                    {
                        "name": "data",
                        "value": "{\"Date\": \"now\"}"
                    }
                ],
                "optional parameters": []
            },
            {
                "tool name": "Mailjet: getSingleCampaignStatistics",
                "tool description": "Accesses a campaign's statistics resource, providing performance insights such as open rates, click-through metrics, and engagement trends. This is part of a comprehensive platform designed to power transactional email, utilizing real-time analytics to deliver actionable data that helps optimize email strategies and improve user engagement.",
                "required parameters": [
                    {
                        "name": "apiKeyPrivate",
                        "value": "your_mailjet_api_key_private"
                    },
                    {
                        "name": "apiKeyPublic",
                        "value": "your_mailjet_api_key_public"
                    },
                    {
                        "name": "id",
                        "value": "{{Campaign ID from the previous step}}"
                    }
                ],
                "optional parameters": []
            }
        ],
        "query_simple_gemini-2.5-pro": "Create a newsletter titled 'July Newsletter Campaign' with the subject 'July Newsletter'. Use the 'July Newsletter' template and send it to the 'Subscribers' contact list immediately. After it's sent, please provide the performance statistics for this campaign.",
        "query_hard_gemini-2.5-pro": "I need to send out our monthly update. Please use the 'July Newsletter' template and send it to our 'Subscribers' list. For tracking purposes, title the campaign 'July Newsletter Campaign' and use 'July Newsletter' as the subject line. This should be in US English and sent out immediately. Once it's on its way, please pull up the performance report for me.",
        "query_simple_claude_v37": "Create and schedule a July newsletter campaign using Mailjet. First, retrieve the available email templates to find the 'July Newsletter' template ID. Then, get the contact lists to identify the 'Subscribers' list ID. Next, create a new newsletter using these IDs with the title 'July Newsletter Campaign' and subject 'July Newsletter'. Schedule the newsletter to be sent immediately. Finally, retrieve the campaign statistics to analyze its performance metrics like open rates and click-through rates.",
        "query_hard_claude_v37": "I need to send out our July newsletter right away. We already have our July Newsletter template and a Subscribers contact list set up in Mailjet. Could you please use those to create and immediately send the newsletter with the subject line 'July Newsletter'? Once it's sent, I'd like to see how it's performing."
    },
    {
        "query": "I'm using the temporary email address example@temp-email.com to sign up for a new service. Can you first confirm that this is a valid temporary email address? After I've completed the signup, please fetch the latest message from its inbox so I can get the confirmation link.",
        "tool list": [
            {
                "tool name": "Email API: Check Temporary Emails",
                "tool description": "Generates a temporary email address that expires after several minutes or hours. This endpoint is part of an Email API designed to validate email addresses (single or bulk via txt/csv), detect temporary or fake emails, check free/paid status, verify MX records, and identify service providers, offering a reliable solution for secure and anonymous communication.",
                "required parameters": [
                    {
                        "name": "email",
                        "value": "example@temp-email.com"
                    }
                ],
                "optional parameters": []
            }
        ],
        "query_simple_gemini-2.5-pro": "Can you check if the email address 'example@temp-email.com' is a temporary one?",
        "query_hard_gemini-2.5-pro": "I'm reviewing a new user account and their email is example@temp-email.com. It looks a bit fishy, can you tell me if it's a temporary or disposable address?",
        "query_simple_claude_v37": "Check if example@temp-email.com is a temporary email address that will expire soon. Use the Email API's temporary email verification tool to determine if this is a disposable email address, when it might expire, and whether it's suitable for important communications that require a permanent contact method.",
        "query_hard_claude_v37": "Can you tell me if example@temp-email.com is one of those disposable email addresses that expire after a short time? I need to know if it's legitimate or just temporary."
    },
    {
        "query": "Please draft a professional follow-up email to jane.doe@example.com regarding our meeting yesterday. Ask her for the project proposal we discussed and mention that I'm looking forward to collaborating. Then, schedule it to be sent tomorrow morning at 9:00 AM EST.",
        "tool list": [
            {
                "tool name": "Mailjet: createCampaignDraft",
                "tool description": "Adds a new campaign draft resource to the transactional email platform, allowing users to create and manage email campaigns. This is part of the comprehensive solution designed to power transactional emails, providing tools for efficient and personalized communication.",
                "required parameters": [
                    {
                        "name": "apiKeyPrivate",
                        "value": "[Your private mailjet API key]"
                    },
                    {
                        "name": "apiKeyPublic",
                        "value": "[Your public mailjet API key]"
                    },
                    {
                        "name": "data",
                        "value": "{\"Locale\": \"en_US\", \"Subject\": \"Follow-up from our meeting\", \"ContactsListID\": \"[Contacts_List_ID_containing_jane.doe@example.com]\", \"SenderName\": \"[Your Name]\", \"SenderEmail\": \"[Your_Email_Address]\", \"Html-part\": \"Hi Jane,<br><br>It was a pleasure meeting with you yesterday. I'm writing to follow up on our discussion regarding the project proposal.<br><br>I'm very much looking forward to the possibility of collaborating.<br><br>Best regards,<br>[Your Name]\"}"
                    }
                ],
                "optional parameters": []
            },
            {
                "tool name": "Mailjet: createCampaignDraftScheduled",
                "tool description": "Schedules the sending of a campaign draft at a specified time. This endpoint is part of the complete solution to power your transactional email, enabling precise control over email delivery timelines to enhance campaign effectiveness and ensure timely communication with recipients.",
                "required parameters": [
                    {
                        "name": "data",
                        "value": "{\"Date\": \"[Tomorrow's Date in YYYY-MM-DD format]T09:00:00\", \"Timezone\": \"EST\"}"
                    },
                    {
                        "name": "id",
                        "value": "[Campaign_ID from createCampaignDraft]"
                    },
                    {
                        "name": "apiKeyPrivate",
                        "value": "[Your private mailjet API key]"
                    },
                    {
                        "name": "apiKeyPublic",
                        "value": "[Your public mailjet API key]"
                    }
                ],
                "optional parameters": []
            }
        ],
        "query_simple_gemini-2.5-pro": "Create an email campaign draft with the subject 'Follow-up from our meeting' for the contacts list that includes jane.doe@example.com. The sender's name is '[Your Name]' and their email is '[Your_Email_Address]'. The email body should be: 'Hi Jane,<br><br>It was a pleasure meeting with you yesterday. I\\'m writing to follow up on our discussion regarding the project proposal.<br><br>I\\'m very much looking forward to the possibility of collaborating.<br><br>Best regards,<br>[Your Name]'. After creating the draft, schedule it to be sent tomorrow at 9:00 AM EST.",
        "query_hard_gemini-2.5-pro": "I need to send a follow-up email to my contact, Jane Doe. Can you set it up to go out tomorrow at 9 AM EST? The subject should be 'Follow-up from our meeting'. For the body, please write a friendly note saying it was a pleasure meeting yesterday, that I'm following up on our project proposal discussion, and that I'm looking forward to the possibility of collaborating. Please sign it with 'Best regards' followed by my name.",
        "query_simple_claude_v37": "Create a follow-up email campaign draft in Mailjet with the subject 'Follow-up from our meeting' to be sent to Jane Doe, then schedule this campaign to be sent automatically at 9:00 AM EST tomorrow.",
        "query_hard_claude_v37": "I need to send a follow-up email to Jane Doe about our meeting yesterday regarding the project proposal. Can you draft an email mentioning I enjoyed our meeting and look forward to collaborating, then schedule it to be sent tomorrow morning at 9 AM EST? I want to use my Mailjet account for this."
    },
    {
        "query": "I'm tired of getting so much marketing emails. Please help me identify the source of these emails and add their address to my unsubscribe list so I don't get any more messages from them.",
        "tool list": [
            {
                "tool name": "MailGun: addAddressToUnsubscribeTable",
                "tool description": "Adds an email address to the unsubscribe table to prevent future communications. This functionality is part of a comprehensive email management system designed to send, validate, receive, and track emails, ensuring compliance with opt-out preferences and enhancing user experience by efficiently managing subscription statuses.",
                "required parameters": [
                    {
                        "name": "apiKey",
                        "value": "<Your MailGun API Key>"
                    },
                    {
                        "name": "address",
                        "value": "<The email address of the sender you want to unsubscribe>"
                    },
                    {
                        "name": "domain",
                        "value": "<The domain name registered with your MailGun account>"
                    }
                ],
                "optional parameters": [
                    {
                        "name": "tag",
                        "value": "*"
                    }
                ]
            }
        ],
        "query_simple_gemini-2.5-pro": "Please add the email address 'example@email.com' to the unsubscribe list for the 'mybusiness.com' domain to block all future communications.",
        "query_hard_gemini-2.5-pro": "Hey, could you please make sure that mycoolapp.com stops sending any and all communications to spam@example.com? I want to block them entirely.",
        "query_simple_claude_v37": "Add an email address to the unsubscribe list in MailGun to prevent sending future communications to that address. I need to provide my MailGun API key, the specific email address I want to unsubscribe, and my registered domain name. Optionally, I can specify a tag to unsubscribe from specific types of communications rather than all emails.",
        "query_hard_claude_v37": "I keep getting marketing emails from your company and I'd like to stop receiving them. Can you please add my email address to your unsubscribe list so I don't get any more messages from your domain? I want to opt out of all types of communications."
    }
]