[
    {
        "query": "I'm thinking about buying 'Cyberpunk 2077' for PC. Can you first check what the best current deal is? Also, pull the latest reviews to see if the game is any good now. Finally, are there any recent articles about game delays for its upcoming expansion?",
        "tool list": [
            {
                "tool name": "CheapShark - Game Deals: List of Games",
                "tool description": "Retrieves a list of games matching a specific title or SteamAppID, including the cheapest current deal for each game. This endpoint is part of CheapShark, a price comparison platform that tracks digital PC game prices across multiple stores like Steam, GreenManGaming, and Fanatical, enabling users to find affordable gaming options by aggregating and analyzing deal data from its extensive network of retailers.",
                "required parameters": [],
                "optional parameters": [
                    {
                        "name": "title",
                        "value": "Cyberpunk 2077"
                    }
                ]
            },
            {
                "tool name": "OpenCritic API: Game Search",
                "tool description": "Searches OpenCritic for games with similar names/titles using inverse trigram distance, where 0 represents a perfect match and 1 indicates no shared trigrams. This endpoint leverages the pg_trgm library for efficient text similarity calculations, enabling precise game discovery by analyzing title patterns. As part of an API for video game and review data, it enhances user experience by surfacing relevant game recommendations through advanced text matching algorithms.",
                "required parameters": [
                    {
                        "name": "criteria",
                        "value": "Cyberpunk 2077"
                    }
                ],
                "optional parameters": []
            },
            {
                "tool name": "OpenCritic API: Reviews for Game",
                "tool description": "Retrieves video game reviews for a specified Game ID. This endpoint is part of an API that provides access to comprehensive video game and review data, aggregating information from multiple sources to offer detailed insights and ratings for players and developers.",
                "required parameters": [
                    {
                        "name": "id",
                        "value": "{{id from the previous step}}"
                    }
                ],
                "optional parameters": [
                    {
                        "name": "sort",
                        "value": "newest"
                    }
                ]
            },
            {
                "tool name": "Game Delay Radar: Get All Avaliable Game Delay news",
                "tool description": "Retrieves articles about game release delays from specific game news websites. This is part of an API that aggregates the latest news from multiple game news sites, providing timely updates on delays and industry developments.",
                "required parameters": [
                    {
                        "name": "lang",
                        "value": "eng"
                    }
                ],
                "optional parameters": []
            }
        ],
        "query_simple_gemini-2.5-pro": "What are the newest reviews for 'Baldur's Gate 3' and are there any recent articles about game delays in English?",
        "query_hard_gemini-2.5-pro": "I'm thinking about finally picking up Cyberpunk 2077. Can you find me the best price available for it right now and also show me what the most recent reviews are saying? Separately, could you also find any news in English about other games being delayed?",
        "query_simple_claude_v37": "Find the cheapest deals for Cyberpunk 2077, then search for its reviews on OpenCritic, and finally check if there have been any recent game delay news in English",
        "query_hard_claude_v37": "I'm thinking about buying Cyberpunk 2077. Can you tell me the current deals for it, what critics are saying in their most recent reviews, and if there's been any news about delays for the game?"
    },
    {
        "query": "I want to watch the next big CS:GO tournament. Can you find the schedule for upcoming matches? For the first match on the list, can you get me the recent match history for both of the teams playing so I can see who is favored?",
        "tool list": [
            {
                "tool name": "CSGO matches and tournaments: Upcoming",
                "tool description": "Retrieves the last of upcoming CS:GO matches by querying a real-time esports database. This uses AI-powered data aggregation to provide up-to-the-minute information on tournament schedules, ensuring users stay informed about the latest competitive events.",
                "required parameters": [],
                "optional parameters": [
                    {
                        "name": "limit",
                        "value": "10"
                    },
                    {
                        "name": "page",
                        "value": "1"
                    }
                ]
            }
        ],
        "query_simple_gemini-2.5-pro": "Can you show me the next 10 upcoming CS:GO matches?",
        "query_hard_gemini-2.5-pro": "Can you show me a list of the next 10 upcoming CS:GO matches?",
        "query_simple_claude_v37": "Show me the next 10 upcoming CS:GO matches and tournaments",
        "query_hard_claude_v37": "What are the next 10 upcoming CSGO matches? I want to know what tournaments are happening soon."
    },
    {
        "query": "I need to optimize my Guild Wars 2 character, 'MyAwesomeWarrior'. Please access my account and retrieve my character's currently equipped items. I also need to see what skills I have equipped. Finally, what is the current in-game exchange rate between gems and gold so I can see if I can afford a new item from the trading post?",
        "tool list": [
            {
                "tool name": "GuildWars2: getCharacters",
                "tool description": "Retrieves character information associated with a specific account. This endpoint provides detailed data about characters within the Guild Wars 2 universe, leveraging the game's backend systems to fetch account-specific details. As part of the Guild Wars 2 MMO platform developed by ArenaNet and published by NCSOFT, it enables players to access and manage their in-game characters, offering insights into their progression, inventory, and status within the game's persistent world.",
                "required parameters": [
                    {
                        "name": "apiKey",
                        "value": "Please provide your Guild Wars 2 API key"
                    }
                ],
                "optional parameters": []
            },
            {
                "tool name": "GuildWars2: getCharacterEquipment",
                "tool description": "Retrieves equipment details for a Guild Wars 2 character using their unique ID. This leverages the Guild Wars 2 API to access in-game character data, providing players with precise equipment information to optimize their gameplay and gear management. As part of the Guild Wars 2 ecosystem, this endpoint taps into the game's extensive database of character assets, enabling seamless integration with tools that track progression, compare gear stats, or assist in crafting decisions.",
                "required parameters": [
                    {
                        "name": "characterId",
                        "value": "{{characterId for 'MyAwesomeWarrior' from the previous step}}"
                    },
                    {
                        "name": "apiKey",
                        "value": "Please provide your Guild Wars 2 API key"
                    }
                ],
                "optional parameters": []
            },
            {
                "tool name": "GuildWars2: getCharacterSkills",
                "tool description": "Retrieves a character's skills based on their unique identifier. This endpoint is part of the Guild Wars 2 API, which provides access to game data for players and developers. It leverages the Guild Wars 2 game database to fetch detailed skill information, enabling players to optimize character builds and developers to integrate game data into third-party tools.",
                "required parameters": [
                    {
                        "name": "characterId",
                        "value": "{{characterId for 'MyAwesomeWarrior' from the first step}}"
                    },
                    {
                        "name": "apiKey",
                        "value": "Please provide your Guild Wars 2 API key"
                    }
                ],
                "optional parameters": []
            },
            {
                "tool name": "GuildWars2: getGemsExchange",
                "tool description": "Retrieves the current exchange rate between in-game gems and coins. This endpoint is part of the Guild Wars 2 API, which provides players with real-time economic data and resources, drawing from the game's internal economic systems to help users manage their in-game currency effectively.",
                "required parameters": [
                    {
                        "name": "apiKey",
                        "value": "Please provide your Guild Wars 2 API key"
                    },
                    {
                        "name": "quantity",
                        "value": 100
                    }
                ],
                "optional parameters": []
            }
        ],
        "query_simple_gemini-2.5-pro": "With my Guild Wars 2 API key, could you retrieve the equipment and skill set for my character named 'MyAwesomeWarrior'?",
        "query_hard_gemini-2.5-pro": "I need to see the current setup for my character 'MyAwesomeWarrior'. Can you show me what gear and skills they have equipped? Also, while you're at it, could you tell me how many coins I'd get for 100 gems?",
        "query_simple_claude_v37": "Retrieve my Guild Wars 2 character information, specifically for 'MyAwesomeWarrior', then get that character's equipment and skills. Also, check the current exchange rate for 100 gems to coins.",
        "query_hard_claude_v37": "Can you check my Guild Wars 2 character MyAwesomeWarrior's equipment and skills? Also, I'd like to know how many coins I could get for 100 gems right now."
    },
    {
        "query": "I'm playing a game of Blackjack and need some help. The dealer is showing a 7. My hand is two 8s. According to basic strategy, what is the optimal move? Also, I think the deck is rich in high cards; the running count is +8 and there are about 4 decks left in the shoe. What is the True Count?",
        "tool list": [
            {
                "tool name": "BlackJack Basic Strategy: Pairs",
                "tool description": "This endpoint calculates the optimal blackjack action when a player has a pair, requiring the value of the paired cards (e.g., 10 for a Queen and Jack) instead of the total hand value. It is part of an API that analyzes player cards and the dealer's upcard to recommend strategies like hitting, standing, doubling, splitting, or surrendering using established 'Basic Strategy' principles. By focusing on paired card values, it leverages algorithmic decision-making to provide data-driven choices that minimize the house edge in specific scenarios.",
                "required parameters": [
                    {
                        "name": "dealerUpcard",
                        "value": "7"
                    },
                    {
                        "name": "pairOf",
                        "value": "8"
                    }
                ],
                "optional parameters": []
            },
            {
                "tool name": "BlackJack Basic Strategy: True Count",
                "tool description": "Calculates the True Count of a card shoe using the running count and number of decks remaining. This is part of a blackjack strategy API that provides optimal play decisions—such as hitting, standing, doubling, splitting, or surrendering—based on the player's cards and the dealer's upcard, leveraging Basic Strategy to enhance gameplay accuracy.",
                "required parameters": [
                    {
                        "name": "decksRemaining",
                        "value": "4"
                    },
                    {
                        "name": "runningCount",
                        "value": "8"
                    }
                ],
                "optional parameters": []
            }
        ],
        "query_simple_gemini-2.5-pro": "In a blackjack game with 4 decks remaining and a running count of 8, what is the calculated true count?",
        "query_hard_gemini-2.5-pro": "I'm in a tricky spot in my blackjack game. I've got a pair of eights, and the dealer's showing a seven. I've been tracking the cards, and my count is up to 8 with four decks left in the shoe. Based on this, what's my best move, and what's the adjusted count?",
        "query_simple_claude_v37": "I'm playing blackjack and have a pair of 8s against a dealer showing 7. What's the optimal play according to basic strategy? Also, the running count is 8 with 4 decks remaining - what's the true count?",
        "query_hard_claude_v37": "I'm playing blackjack and have a pair of 8s with the dealer showing a 7. Should I split? Also, the running count is 8 with 4 decks remaining in the shoe - what's my true count?"
    },
    {
        "query": "Are there any free games available today? Please check for any free offerings on the Epic Games Store and also get me a list of all current giveaways for PC games from GamerPower.",
        "tool list": [
            {
                "tool name": "Epic Games Store - Free Games: Free Games",
                "tool description": "Retrieves all currently available and upcoming free games from the Epic Games Store, including details about each title and its availability period. This endpoint leverages an unofficial API designed for scraping game offer data, utilizing web scraping techniques to extract real-time information from the Epic Games Store's frontend, providing developers and users with a convenient way to track free game promotions without direct access to Epic's official systems.",
                "required parameters": [],
                "optional parameters": []
            },
            {
                "tool name": "GamerPower: Live giveaways by platform & type & sorted",
                "tool description": "Retrieves live gaming giveaways filtered by platform and type, sorted by relevance or date. This leverages GamerPower.com's database of gaming giveaways to provide programmatic access to curated free games, loot, and promotions, enabling developers to integrate real-time giveaway data into their applications.",
                "required parameters": [],
                "optional parameters": [
                    {
                        "name": "platform",
                        "value": "pc"
                    },
                    {
                        "name": "type",
                        "value": "game"
                    }
                ]
            }
        ],
        "query_simple_gemini-2.5-pro": "What are the currently available and upcoming free games on the Epic Games Store?",
        "query_hard_gemini-2.5-pro": "I want to see all the free games I can get for my PC right now. Can you show me what's on the Epic Games Store and also pull up any other active game giveaways?",
        "query_simple_claude_v37": "Find all currently available and upcoming free PC games from both the Epic Games Store and GamerPower. For Epic Games Store, show all free games with their availability periods. For GamerPower, filter for PC games only.",
        "query_hard_claude_v37": "What free PC games can I get right now? I'm interested in both the Epic Games Store offerings and any other giveaways happening elsewhere."
    },
    {
        "query": "I'm a huge fan of The Legend of Zelda series, and I love open-world adventure games with puzzle-solving elements. I'm looking for new games to play on PC. Can you search for games tagged with 'adventure' that are available on PC? Please check the reviews and rates of the top-5 games to see if they are good games.",
        "tool list": [
            {
                "tool name": "Free-to-Play Games Database: Filter games by multiple tags",
                "tool description": "Filters games by multiple tags and platform to deliver personalized results, with optional sorting parameters. This leverages the FreeToGame.com database—a comprehensive collection of free-to-play games—enabling users to efficiently narrow down options based on preferences, ensuring tailored recommendations from a curated catalog of titles.",
                "required parameters": [
                    {
                        "name": "tag",
                        "value": "adventure"
                    }
                ],
                "optional parameters": [
                    {
                        "name": "platform",
                        "value": "pc"
                    }
                ]
            },
            {
                "tool name": "OpenCritic API: Game Search",
                "tool description": "Searches OpenCritic for games with similar names/titles. Search results are based on inverse trigram distance, with 0 being a perfect match and 1 being no shared/overlapping trigrams. See the [pg_trgm](https://www.postgresql.org/docs/current/pgtrgm.html) library for more information.",
                "required parameters": [
                    {
                        "name": "criteria",
                        "value": "{{title of the first game from the previous step}}"
                    }
                ],
                "optional parameters": []
            },
            {
                "tool name": "OpenCritic API: Reviews for Game",
                "tool description": "Gets reviews for a specific Game ID",
                "required parameters": [
                    {
                        "name": "id",
                        "value": "{{id from the previous step}}"
                    }
                ],
                "optional parameters": []
            },
            {
                "tool name": "OpenCritic API: Game Search",
                "tool description": "Searches OpenCritic for games with similar names/titles. Search results are based on inverse trigram distance, with 0 being a perfect match and 1 being no shared/overlapping trigrams. See the [pg_trgm](https://www.postgresql.org/docs/current/pgtrgm.html) library for more information.",
                "required parameters": [
                    {
                        "name": "criteria",
                        "value": "{{title of the second game from the first step}}"
                    }
                ],
                "optional parameters": []
            },
            {
                "tool name": "OpenCritic API: Reviews for Game",
                "tool description": "Gets reviews for a specific Game ID",
                "required parameters": [
                    {
                        "name": "id",
                        "value": "{{id from the previous step}}"
                    }
                ],
                "optional parameters": []
            },
            {
                "tool name": "OpenCritic API: Game Search",
                "tool description": "Searches OpenCritic for games with similar names/titles. Search results are based on inverse trigram distance, with 0 being a perfect match and 1 being no shared/overlapping trigrams. See the [pg_trgm](https://www.postgresql.org/docs/current/pgtrgm.html) library for more information.",
                "required parameters": [
                    {
                        "name": "criteria",
                        "value": "{{title of the third game from the first step}}"
                    }
                ],
                "optional parameters": []
            },
            {
                "tool name": "OpenCritic API: Reviews for Game",
                "tool description": "Gets reviews for a specific Game ID",
                "required parameters": [
                    {
                        "name": "id",
                        "value": "{{id from the previous step}}"
                    }
                ],
                "optional parameters": []
            },
            {
                "tool name": "OpenCritic API: Game Search",
                "tool description": "Searches OpenCritic for games with similar names/titles. Search results are based on inverse trigram distance, with 0 being a perfect match and 1 being no shared/overlapping trigrams. See the [pg_trgm](https://www.postgresql.org/docs/current/pgtrgm.html) library for more information.",
                "required parameters": [
                    {
                        "name": "criteria",
                        "value": "{{title of the fourth game from the first step}}"
                    }
                ],
                "optional parameters": []
            },
            {
                "tool name": "OpenCritic API: Reviews for Game",
                "tool description": "Gets reviews for a specific Game ID",
                "required parameters": [
                    {
                        "name": "id",
                        "value": "{{id from the previous step}}"
                    }
                ],
                "optional parameters": []
            },
            {
                "tool name": "OpenCritic API: Game Search",
                "tool description": "Searches OpenCritic for games with similar names/titles. Search results are based on inverse trigram distance, with 0 being a perfect match and 1 being no shared/overlapping trigrams. See the [pg_trgm](https://www.postgresql.org/docs/current/pgtrgm.html) library for more information.",
                "required parameters": [
                    {
                        "name": "criteria",
                        "value": "{{title of the fifth game from the first step}}"
                    }
                ],
                "optional parameters": []
            },
            {
                "tool name": "OpenCritic API: Reviews for Game",
                "tool description": "Gets reviews for a specific Game ID",
                "required parameters": [
                    {
                        "name": "id",
                        "value": "{{id from the previous step}}"
                    }
                ],
                "optional parameters": []
            }
        ],
        "query_simple_gemini-2.5-pro": "Could you provide me with the reviews for the first five free-to-play adventure games designed for PC?",
        "query_hard_gemini-2.5-pro": "I'm looking for five free-to-play adventure games I can play on my PC. Can you tell me what the reviews are for each of them?",
        "query_simple_claude_v37": "Find the top free-to-play adventure games on PC and provide professional reviews for the first five games",
        "query_hard_claude_v37": "Can you recommend some good free adventure games for PC and tell me what critics think of them? I'd like to see reviews for the top 5 options."
    },
    {
        "query": "Give me my daily report on PC games. I want to see the top 10 best deals on Steam right now. Also, pull the latest monthly player statistics from SteamCharts for 'Baldur's Gate 3' to see if its popularity is still holding up.",
        "tool list": [
            {
                "tool name": "CheapShark - Game Deals: List of Deals",
                "tool description": "Retrieves a paged list of game deals with optional filtering parameters, allowing users to search across price, store, game title, and other criteria. This endpoint leverages CheapShark's price comparison platform, which tracks digital PC game prices across stores like Steam, GreenManGaming, and Fanatical, providing normalized deal ratings on a 0-10 scale to help users identify optimal purchases. The returned deal objects include encoded dealIDs for linking to the redirect page (https://www.cheapshark.com/redirect?dealID={id}), though this page is intended for end-user navigation rather than automated integration.",
                "required parameters": [],
                "optional parameters": [
                    {
                        "name": "sortBy",
                        "value": "Deal Rating"
                    },
                    {
                        "name": "pageSize",
                        "value": 10
                    },
                    {
                        "name": "desc",
                        "value": true
                    },
                    {
                        "name": "storeID",
                        "value": "1"
                    },
                    {
                        "name": "onSale",
                        "value": true
                    }
                ]
            },
            {
                "tool name": "Steamcharts: detail game",
                "tool description": "Retrieves detailed game data and statistics on a monthly basis. This leverages SteamCharts' database of Steam game metrics to provide insights into player activity, performance trends, and platform-specific analytics, enabling users to track monthly fluctuations in game popularity and engagement.",
                "required parameters": [
                    {
                        "name": "id",
                        "value": "1086940"
                    }
                ],
                "optional parameters": []
            }
        ],
        "query_simple_gemini-2.5-pro": "Retrieve the detailed monthly game data for the game with ID 1086940.",
        "query_hard_gemini-2.5-pro": "Can you show me the top 10 best deals currently on sale on Steam? Also, I'm curious about Baldur's Gate 3, could you pull up its monthly player stats?",
        "query_simple_claude_v37": "Find the top-rated Steam game deals currently on sale, sorted by deal rating, and then show detailed player statistics for Baldur's Gate 3 (game ID 1086940) from Steamcharts.",
        "query_hard_claude_v37": "What are the top-rated Steam deals currently on sale? And can you also show me the monthly player statistics for Baldur's Gate 3?"
    },
    {
        "query": "GOkay, my D&D players are fighting a powerful wizard who is about to cast a spell. Can you look up the full details for the 'Fireball' spell? One of my players is trying to sneak past him, so please roll a d20 for their stealth check. After the fight, they find a magic item. Please get the details for a 'Staff of Power'.",
        "tool list": [
            {
                "tool name": "Dungeons and Dragon 5e: Get spell",
                "tool description": "Retrieves detailed information about a D&D spell, including its school of magic, level, and full description. This is part of a D&D 5e data tool that provides comprehensive details on classes, subclasses, items, spells, and feats, leveraging a specialized database to ensure accurate and thorough information for players and game designers.",
                "required parameters": [
                    {
                        "name": "spell_name",
                        "value": "fireball"
                    }
                ],
                "optional parameters": []
            },
            {
                "tool name": "Dice Roll Simulator: Custom dice rolls",
                "tool description": "Rolls any number of dice with specified sides and frequencies, powered by the ultimate dice rolling API's flexible framework to process custom configurations and efficiently generate results.",
                "required parameters": [],
                "optional parameters": [
                    {
                        "name": "dice",
                        "value": "1"
                    },
                    {
                        "name": "sides",
                        "value": "20"
                    },
                    {
                        "name": "rolls",
                        "value": "1"
                    }
                ]
            },
            {
                "tool name": "Dungeons and Dragon 5e: Get item",
                "tool description": "Returns detailed information about D&D magic items in JSON format. This endpoint is part of a broader tool that provides data on classes, subclasses, items, spells, and feats from D&D 5e, leveraging a comprehensive database of game content to deliver precise, structured insights for character customization and game design.",
                "required parameters": [
                    {
                        "name": "item_name",
                        "value": "staff-of-power"
                    }
                ],
                "optional parameters": []
            }
        ],
        "query_simple_gemini-2.5-pro": "I need to know the spell school for Fireball and the item description for the Staff of Power. Also, could you roll 3d8 for me?",
        "query_hard_gemini-2.5-pro": "I'm getting ready for my D&D game. Can you tell me everything about the fireball spell and also pull up the description for a Staff of Power? After that, please make a single d20 roll for me.",
        "query_simple_claude_v37": "Tell me about the Fireball spell in D&D 5e, then roll a d20 to see if my wizard successfully casts it, and finally provide information about the Staff of Power magic item that could enhance my spellcasting.",
        "query_hard_claude_v37": "I'm planning to use fireball in my next D&D session, can you tell me about this spell? Also, I need to roll a d20 for my attack. By the way, my character might find a staff of power - what does that magic item do?"
    }
]