[
    {
        "query": "I need a full briefing on the latest developments in cryptocurrency regulation. Please search for recent articles about this topic on Google News. For the most relevant article you find, please extract its full text and then find three related articles from other sources to give me more context.",
        "tool list": [
            {
                "tool name": "Google News API: Get articles",
                "tool description": "Retrieves and filters Google News articles using keywords, dates, and categories. This leverages the Google News API, a REST-based service providing access to over 1 million news sources and tens of millions of articles across 10 languages, enabling efficient search and aggregation of current and archived content while prioritizing trending stories through Google News' ranking system.",
                "required parameters": [
                    {
                        "name": "language",
                        "value": "EN"
                    }
                ],
                "optional parameters": [
                    {
                        "name": "q",
                        "value": "latest developments in cryptocurrency regulation"
                    },
                    {
                        "name": "sort",
                        "value": "date:desc"
                    },
                    {
                        "name": "limit",
                        "value": "1"
                    }
                ]
            },
            {
                "tool name": "AI News - Global: Extract Full Content",
                "tool description": "Extracts news articles from a provided URL generated by the Get News method. This endpoint leverages AI-powered web scraping to retrieve and condense content from global sources, utilizing a dynamic network of online publications to deliver concise, up-to-date articles tailored to user interests.",
                "required parameters": [
                    {
                        "name": "url",
                        "value": "[URL of the article found in the previous step]"
                    },
                    {
                        "name": "version",
                        "value": "v1"
                    }
                ],
                "optional parameters": []
            },
            {
                "tool name": "AI News - Global: Get Related News",
                "tool description": "Retrieves related news articles from external sources linked to a specific news article returned by the Get News method. This is part of the Global News platform, an AI-powered service that curates and delivers comprehensive coverage by analyzing contextual connections across diverse sources, offering personalized recommendations based on user preferences and real-time relevance.",
                "required parameters": [
                    {
                        "name": "region",
                        "value": "us"
                    },
                    {
                        "name": "title",
                        "value": "[Title of the article found in the first step]"
                    },
                    {
                        "name": "version",
                        "value": "v1"
                    }
                ],
                "optional parameters": []
            }
        ],
        "query_simple_gemini-2.5-pro": "Find the most recent English news article about the latest developments in cryptocurrency regulation. Once found, extract its full content and also find related news articles from the US based on the original article's title.",
        "query_hard_gemini-2.5-pro": "Could you find me the single most recent English-language article covering the latest developments in cryptocurrency regulation? I'd like to read the whole piece, and then could you also pull up some related stories from the US?",
        "query_simple_claude_v37": "Find the latest news article about cryptocurrency regulation, extract its full content, and then get related news articles from US sources",
        "query_hard_claude_v37": "Can you find me the most recent article about cryptocurrency regulation and give me its full content? Also, I'd like to see other related news stories from US sources."
    },
    {
        "query": "I'm tracking a specific politician, Jane Doe (goverlytics_id: 54321). Can you retrieve her latest profile information from your database? Also, check for any upcoming events she is scheduled to attend in the next month.",
        "tool list": [
            {
                "tool name": "Goverlytics: politician/{goverlytics_id}",
                "tool description": "Retrieves a politician's information using their unique 'goverlytics_id'. This endpoint is part of the Goverlytics API, which provides access to a comprehensive database of political figures and their details, enabling efficient and accurate data retrieval for analysis and research purposes.",
                "required parameters": [
                    {
                        "name": "goverlytics_id",
                        "value": "54321"
                    }
                ],
                "optional parameters": []
            },
            {
                "tool name": "Goverlytics: records",
                "tool description": "Fetches records data based on specified parameters. This is part of the Goverlytics API, which provides advanced data retrieval and analytics capabilities, leveraging a comprehensive database to deliver precise and actionable insights efficiently.",
                "required parameters": [],
                "optional parameters": [
                    {
                        "name": "speaker_id",
                        "value": "54321"
                    },
                    {
                        "name": "substring",
                        "value": "schedule"
                    }
                ]
            }
        ],
        "query_simple_gemini-2.5-pro": "Find all records spoken by the politician with the goverlytics_id 54321 that contain the substring 'schedule'.",
        "query_hard_gemini-2.5-pro": "Find me everything the official with ID 54321 has said about their schedule.",
        "query_simple_claude_v37": "Find information about the politician with Goverlytics ID 54321 and retrieve any records where this politician mentioned the word 'schedule' in their speeches or statements.",
        "query_hard_claude_v37": "Can you find any records where politician 54321 mentioned something about a schedule?"
    },
    {
        "query": "There was a major announcement from the Financial Times today about a new market trend. Find me the article with ID 'xyz-abc'. I don't just want the text; please also retrieve any associated images and videos from the article so I can use them in a presentation.",
        "tool list": [
            {
                "tool name": "FinancialTimes: getContentById",
                "tool description": "Retrieves specific Financial Times content using an ID. This is part of a service that provides financial news, blog posts, and articles, leveraging a database of financial content to quickly fetch precise articles, enabling users to access targeted information efficiently.",
                "required parameters": [
                    {
                        "name": "itemId",
                        "value": "xyz-abc"
                    },
                    {
                        "name": "apiKey",
                        "value": "YOUR_API_KEY"
                    }
                ],
                "optional parameters": []
            }
        ],
        "query_simple_gemini-2.5-pro": "Please retrieve the Financial Times content for the item with ID xyz-abc.",
        "query_hard_gemini-2.5-pro": "I need to find a specific article from the Financial Times. Could you pull up the one with the reference ID xyz-abc for me?",
        "query_simple_claude_v37": "Retrieve the Financial Times article with ID xyz-abc using the FinancialTimes: getContentById tool",
        "query_hard_claude_v37": "Could you pull up that Financial Times article I was reading earlier? I saved the reference code xyz-abc but I can't figure out how to access it again."
    },
    {
        "query": "What's the general feeling in the financial world today? Get me the latest business news. For the top article you find, can you run a sentiment analysis on its content and tell me if the tone is positive, negative, or neutral?",
        "tool list": [
            {
                "tool name": "News API_v2: Top Headlines",
                "tool description": "Retrieves top headlines news from 2500+ global publishers worldwide. This endpoint serves as part of a comprehensive news aggregation API, offering a reliable alternative to Google News and Bing News by leveraging a vast network of 2500+ publishers to deliver real-time, curated headlines tailored to user preferences and regional relevance.",
                "required parameters": [],
                "optional parameters": [
                    {
                        "name": "category",
                        "value": "business"
                    },
                    {
                        "name": "pageSize",
                        "value": "1"
                    },
                    {
                        "name": "country",
                        "value": "us"
                    }
                ]
            },
            {
                "tool name": "News Sentiment: URL",
                "tool description": "Analyzes the sentiment of English news articles based on a provided URL. This service leverages natural language processing to evaluate the emotional tone of the content, offering cost-effective insights at $0.00001 per request. It enables users to quickly gauge public sentiment from news sources, supporting informed decision-making with scalable and affordable analysis.",
                "required parameters": [
                    {
                        "name": "url",
                        "value": "{{url from the previous step}}"
                    }
                ],
                "optional parameters": []
            }
        ],
        "query_simple_gemini-2.5-pro": "Find the top business news headline in the United States and analyze the sentiment of the article.",
        "query_hard_gemini-2.5-pro": "What's the single latest top story in US business news, and what is the overall sentiment of the article?",
        "query_simple_claude_v37": "Find the top US business headline and analyze its sentiment",
        "query_hard_claude_v37": "What's the sentiment of today's top business headline in the US?"
    },
    {
        "query": "I want you to set up a daily news feed for me. Every morning, please fetch the latest articles on three topics I follow: cryptocurrency, climate change, and Hollywood movie news. Please provide me with the top headlines for each category.",
        "tool list": [
            {
                "tool name": "Crypto News_v2: Get Individual News Source",
                "tool description": "Retrieves cryptocurrency news articles from a specific source, including 18 options like CryptoNews, Coindesk, and Cointelegraph. This endpoint is part of a broader tool that provides recent crypto news, allowing users to search by keywords for related articles or access general market information.",
                "required parameters": [
                    {
                        "name": "newspaperId",
                        "value": "cryptonews"
                    }
                ],
                "optional parameters": []
            },
            {
                "tool name": "Climate Change News_v5: Get News From Single News Resource",
                "tool description": "Retrieves climate change news from a specific resource. This endpoint is part of an API that delivers the latest global climate change news, aggregating updates from diverse sources to keep users informed about critical developments.",
                "required parameters": [
                    {
                        "name": "id",
                        "value": "thetimes"
                    }
                ],
                "optional parameters": []
            },
            {
                "tool name": "Movie Articles and News: Get Articles By Publisher",
                "tool description": "Retrieves articles from a specific Hollywood publisher. This endpoint is part of an API that delivers the latest news in and around Hollywood, utilizing a curated database of entertainment sources to provide targeted content from verified publishers, ensuring users stay updated on industry-specific updates and trends.",
                "required parameters": [
                    {
                        "name": "publisher",
                        "value": "variety"
                    }
                ],
                "optional parameters": []
            }
        ],
        "query_simple_gemini-2.5-pro": "Retrieve the latest climate change news from The Times.",
        "query_hard_gemini-2.5-pro": "I need a news roundup. First, get me cryptocurrency articles from CryptoNews. Then, find updates on climate change from The Times. Finally, pull up movie news from Variety.",
        "query_simple_claude_v37": "Retrieve cryptocurrency news from CryptoNews, climate change news from The Times, and Hollywood entertainment articles from Variety",
        "query_hard_claude_v37": "I'm doing research on media coverage across different industries. Could you get me the latest articles from Cryptonews for cryptocurrency, The Times for climate change, and Variety for Hollywood news? I need to compare how different specialized publications are covering these three distinct topics."
    }
]