[
    {
        "query": "Give me a complete financial workup on Apple (AAPL). I want to see their latest quarterly income statement and balance sheet. Also, pull the current institutional ownership percentage and any recent insider transactions. Finally, what is the consensus analyst price target for the stock?",
        "tool list": [
            {
                "tool name": "US Stock Info: Get Quarterly Income Statement",
                "tool description": "This API returns the annual and quarterly income statements for the company of interest. Append the ticker of the company of interest along with your Rapid API key to the endpoint.\n\n**Example:**\n\n> https://us-stock-info.p.rapidapi.com/api/v1/getIncomeStatementData/quarterly/AAPL?rapidapi-key=YOUR_RAPID_API_KEY",
                "required parameters": [
                    {
                        "name": "ticker",
                        "value": "AAPL"
                    }
                ],
                "optional parameters": []
            },
            {
                "tool name": "US Stock Info: Get Quarterly  Balance Sheet",
                "tool description": "This API returns the annual and quarterly balance sheet statements for the company of interest. Append the ticker of the company of interest along with your Rapid API key to the endpoint.\n\n**Example:**\n\n> https://us-stock-info.p.rapidapi.com/api/v1/getBalanceSheetData/quarterly/AAPL?rapidapi-key=YOUR_RAPID_API_KEY",
                "required parameters": [
                    {
                        "name": "ticker",
                        "value": "AAPL"
                    }
                ],
                "optional parameters": []
            },
            {
                "tool name": "Mboum Finance: stock/institution-ownership/{stock}",
                "tool description": "Get stock institution ownership.",
                "required parameters": [
                    {
                        "name": "symbol",
                        "value": "AAPL"
                    }
                ],
                "optional parameters": []
            },
            {
                "tool name": "Mboum Finance: stock/insider-transactions/{stock}",
                "tool description": "Get stock insider transactions history.",
                "required parameters": [
                    {
                        "name": "symbol",
                        "value": "AAPL"
                    }
                ],
                "optional parameters": []
            },
            {
                "tool name": "Twelve Data: Price Target",
                "tool description": "This API endpoint returns the analysts' projection of a security's future price.\n\nAvailability: Mega plan\nData weighting: 75 API credits per symbol",
                "required parameters": [
                    {
                        "name": "symbol",
                        "value": "AAPL"
                    }
                ],
                "optional parameters": []
            }
        ],
        "query_simple_gemini-2.5-pro": "Can you provide a summary of the institutional ownership and a history of insider transactions for the stock with the ticker AAPL?",
        "query_hard_gemini-2.5-pro": "Can you do a full financial workup on Apple for me? I'd like to see their latest quarterly income and balance sheet information, a breakdown of institutional ownership, a summary of recent insider trading activity, and what the analysts' price targets are looking like.",
        "query_simple_claude_v37": "Perform a comprehensive financial analysis of Apple Inc. (AAPL) by retrieving its quarterly income statement and balance sheet data, examining its institutional ownership structure, reviewing recent insider transactions, and obtaining analysts' price targets to understand the company's financial health and market outlook.",
        "query_hard_claude_v37": "I'm doing a comprehensive analysis of Apple stock. Could you help me gather their latest quarterly financial statements, both income and balance sheet data? I'd also like to know about institutional ownership and recent insider transactions. Finally, I'm curious what analysts are predicting for AAPL's future price targets."
    },
    {
        "query": "Analyze the daily chart for Tesla (TSLA) going back one year. I need you to calculate two things: the 14-day Relative Strength Index (RSI) and the standard Moving Average Convergence Divergence (MACD). Let me know if the current RSI is below 30 and the MACD line has crossed above its signal line, as this is a buy signal for my strategy.",
        "tool list": [
            {
                "tool name": "Twelve Data: RSI",
                "tool description": "Relative Strength Index(RSI) is a momentum indicator, which calculates the magnitude of a price change to assess the overbought and oversold conditions in the price of an asset.",
                "required parameters": [
                    {
                        "name": "symbol",
                        "value": "TSLA"
                    },
                    {
                        "name": "interval",
                        "value": "1day"
                    }
                ],
                "optional parameters": [
                    {
                        "name": "time_period",
                        "value": "14"
                    },
                    {
                        "name": "outputsize",
                        "value": "365"
                    },
                    {
                        "name": "series_type",
                        "value": "close"
                    }
                ]
            },
            {
                "tool name": "Twelve Data: MACD",
                "tool description": "Moving Average Convergence Divergence(MACD) is a trend following momentum indicator, which works by subtracting the longer moving average from the shorter one. MACD has an unstable period ~ 100.",
                "required parameters": [
                    {
                        "name": "symbol",
                        "value": "TSLA"
                    },
                    {
                        "name": "interval",
                        "value": "1day"
                    }
                ],
                "optional parameters": [
                    {
                        "name": "fast_period",
                        "value": "12"
                    },
                    {
                        "name": "slow_period",
                        "value": "26"
                    },
                    {
                        "name": "signal_period",
                        "value": "9"
                    },
                    {
                        "name": "outputsize",
                        "value": "365"
                    },
                    {
                        "name": "series_type",
                        "value": "close"
                    }
                ]
            }
        ],
        "query_simple_gemini-2.5-pro": "What are the daily RSI and MACD for TSLA?",
        "query_hard_gemini-2.5-pro": "Could you help me analyze Tesla's stock performance? I'd like to see its daily momentum over the last year by looking at the RSI and MACD indicators. Please use the standard configurations for both and base the calculations on the closing price.",
        "query_simple_claude_v37": "Analyze Tesla (TSLA) stock using both RSI and MACD indicators with daily intervals. For RSI, use a 14-day time period with 365 days of data based on closing prices. For MACD, calculate using standard parameters (12-day fast period, 26-day slow period, and 9-day signal period) with 365 days of data based on closing prices.",
        "query_hard_claude_v37": "I'd like to analyze Tesla stock using both RSI and MACD indicators. Can you show me the daily RSI values for TSLA over the past year using the standard 14-day period? Also, I want to see the MACD for Tesla using the typical 12-26-9 settings, also on a daily timeframe for the last year."
    },
    {
        "query": "What's the current mood surrounding NVIDIA (NVDA)? Please pull the most recent 30 messages mentioning the $NVDA cashtag from StockTwits. Separately, use the sentiment analysis tool to get a list of the most positive and most negative news headlines about the company from the past week.",
        "tool list": [
            {
                "tool name": "StockTwits: streams/symbol",
                "tool description": "Returns the most recent 30 messages for the specified symbol, leveraging StockTwits' social communications platform to provide real-time market insights. This endpoint taps into the platform's social graph, aggregating user-generated discussions and sentiment around specific symbols to help investors stay informed about dynamic market trends and community-driven perspectives.",
                "required parameters": [
                    {
                        "name": "id",
                        "value": "NVDA"
                    }
                ],
                "optional parameters": [
                    {
                        "name": "limit",
                        "value": 30
                    }
                ]
            },
            {
                "tool name": "Stock Sentiment API: Most Positive News",
                "tool description": "Returns a list of the most positive articles related to a given stock, using sentiment scores from the compound field, with the number of articles adjustable via the count parameter (capped at 100). This endpoint is part of a real-time social sentiment API that analyzes news activity for stocks, leveraging AI-driven sentiment analysis on live data from multiple sources to provide actionable insights into market sentiment trends.",
                "required parameters": [
                    {
                        "name": "ticker",
                        "value": "NVDA"
                    }
                ],
                "optional parameters": [
                    {
                        "name": "count",
                        "value": "5"
                    }
                ]
            },
            {
                "tool name": "Stock Sentiment API: Most Negative News",
                "tool description": "Returns the most negative articles related to a stock, with the number of articles adjustable via the count parameter (capping at 100). This is part of a real-time social sentiment API that tracks news activity for stocks, utilizing natural language processing to analyze sentiment from aggregated news sources and providing actionable insights into market sentiment trends.",
                "required parameters": [
                    {
                        "name": "ticker",
                        "value": "NVDA"
                    }
                ],
                "optional parameters": [
                    {
                        "name": "count",
                        "value": "5"
                    }
                ]
            }
        ],
        "query_simple_gemini-2.5-pro": "For the stock NVDA, retrieve the 5 most positive and 5 most negative news articles, and also get the 30 most recent messages from StockTwits.",
        "query_hard_gemini-2.5-pro": "Can you give me a full picture of the current sentiment around NVDA? I'd like to see the latest chatter from StockTwits, and also find the top five most positive and five most negative news reports.",
        "query_simple_claude_v37": "Analyze the sentiment around NVIDIA (NVDA) stock by gathering recent social media messages from StockTwits and identifying both the most positive and most negative news articles about the company",
        "query_hard_claude_v37": "What are people saying about NVIDIA stock on social media right now? Also, could you find me some of the most positive and negative recent news articles about NVDA?"
    },
    {
        "query": "I'm looking for new investment ideas. Can you run a custom screen to find me all US-based Technology sector stocks with a market cap over $50 billion where there has been significant net share purchase activity by institutions in the last quarter?",
        "tool list": [
            {
                "tool name": "EOD Historical Data: Stock Market Screener API",
                "tool description": "The Screener API is a powerful tool that helps you filter out tickers with the given parameters. The API supports filtering by multiple fields like market capitalization, sector, exchange, and more.",
                "required parameters": [],
                "optional parameters": [
                    {
                        "name": "filters",
                        "value": "[[\"exchange\",\"=\",\"us\"],[\"sector\",\"=\",\"Technology\"],[\"market_capitalization\",\">\",50000000000]]"
                    },
                    {
                        "name": "limit",
                        "value": "100"
                    }
                ]
            },
            {
                "tool name": "Mboum Finance: stock/net-share-purchase-activity/{stock}",
                "tool description": "Get net share purchase activity information for a particular stock. This will be called for each stock returned from the screener in Step 1.",
                "required parameters": [
                    {
                        "name": "symbol",
                        "value": "<symbol_from_step_1>"
                    }
                ],
                "optional parameters": []
            }
        ],
        "query_simple_gemini-2.5-pro": "For US-based technology companies with a market capitalization greater than $50 billion, what is their net share purchase activity?",
        "query_hard_gemini-2.5-pro": "Could you give me a rundown of the net share purchase activity for the biggest players in the US tech industry? I'm thinking of companies with a market value over $50 billion. Just show me up to 100 of them.",
        "query_simple_claude_v37": "Find large technology companies in the US with market capitalization over $50 billion, and then analyze their net share purchase activity. First screen for US technology stocks with market cap > $50B, then get the net share purchase activity for each of these stocks.",
        "query_hard_claude_v37": "Can you find major US technology companies with market caps over $50 billion and tell me about their net share purchase activity?"
    },
    {
        "query": "I want to set up an automated trade for Google (GOOGL). Please monitor its daily price. If its 14-day RSI drops below 30, automatically execute a market buy order for 10 shares using my Alpaca trading account. After placing the order, please retrieve the order details to confirm it has been filled and at what price.",
        "tool list": [
            {
                "tool name": "Twelve Data: RSI",
                "tool description": "Relative Strength Index(RSI) is a momentum indicator, which calculates the magnitude of a price change to assess the overbought and oversold conditions in the price of an asset.",
                "required parameters": [
                    {
                        "name": "symbol",
                        "value": "GOOGL"
                    },
                    {
                        "name": "interval",
                        "value": "1day"
                    }
                ],
                "optional parameters": [
                    {
                        "name": "time_period",
                        "value": 14
                    },
                    {
                        "name": "outputsize",
                        "value": 1
                    }
                ]
            },
            {
                "tool name": "Alpaca Trading: Request a new order",
                "tool description": "Places a new order for the given account. An order request may be rejected if the account is not authorized for trading, or if the tradable balance is insufficient to fill the order.",
                "required parameters": [
                    {
                        "name": "symbol",
                        "value": "GOOGL"
                    },
                    {
                        "name": "qty",
                        "value": 10
                    },
                    {
                        "name": "side",
                        "value": "buy"
                    },
                    {
                        "name": "type",
                        "value": "market"
                    },
                    {
                        "name": "time_in_force",
                        "value": "day"
                    }
                ],
                "optional parameters": []
            },
            {
                "tool name": "Alpaca Trading: Get an order",
                "tool description": "Retrieves a single of order for the given order_id.",
                "required parameters": [
                    {
                        "name": "order_id",
                        "value": "<order_id_from_step_2>"
                    }
                ],
                "optional parameters": []
            }
        ],
        "query_simple_gemini-2.5-pro": "What is the daily RSI for GOOGL? Subsequently, place a day-long market order to buy 10 shares of it, and then check the status of that order.",
        "query_hard_gemini-2.5-pro": "Could you check the daily momentum for Google's stock to see if it's currently oversold? If it looks like a good time to buy, please purchase 10 shares for me at the current market price, and make sure the order is only good for today. Afterwards, let me know the status of that purchase.",
        "query_simple_claude_v37": "Check the RSI for Google stock (GOOGL) with a 1-day interval, then place a market buy order for 10 shares of GOOGL with day time-in-force, and finally verify the order status by retrieving the order details using the order ID obtained from the buy order.",
        "query_hard_claude_v37": "I'd like to check the RSI for Google stock and if it looks good, buy 10 shares right away as a day order. After placing the order, can you show me the order details?"
    },
    {
        "query": "I'm deciding between two Vanguard mutual funds: VFIAX (S&P 500 index fund) and VTSAX (Total Stock Market index fund). Can you pull a detailed comparison? I need to see the full portfolio composition for both, including their top holdings and sector weightings. Also, retrieve their detailed performance metrics for the last year and their overall risk ratings from your data provider.",
        "tool list": [
            {
                "tool name": "Twelve Data: All data",
                "tool description": "This API request returns a complete breakdown of a mutual fund, including summary, performance, risk, ratings, composition, purchase_info, and sustainability.\n\nAvailability: Mega plan\nData weighting: 1000 API credits per symbol",
                "required parameters": [
                    {
                        "name": "symbol",
                        "value": "VFIAX"
                    }
                ],
                "optional parameters": []
            },
            {
                "tool name": "Twelve Data: All data",
                "tool description": "This API request returns a complete breakdown of a mutual fund, including summary, performance, risk, ratings, composition, purchase_info, and sustainability.\n\nAvailability: Mega plan\nData weighting: 1000 API credits per symbol",
                "required parameters": [
                    {
                        "name": "symbol",
                        "value": "VTSAX"
                    }
                ],
                "optional parameters": []
            }
        ],
        "query_simple_gemini-2.5-pro": "What are the differences in performance, risk, and composition between the VFIAX and VTSAX mutual funds?",
        "query_hard_gemini-2.5-pro": "I'm looking into a couple of mutual funds, VFIAX and VTSAX. Can you give me a full rundown on both of them?",
        "query_simple_claude_v37": "Compare the complete breakdown of two mutual funds: VFIAX and VTSAX, including their summary, performance, risk, ratings, composition, purchase information, and sustainability metrics.",
        "query_hard_claude_v37": "Can you compare the Vanguard S&P 500 Index Fund (VFIAX) and the Vanguard Total Stock Market Index Fund (VTSAX) for me? I'd like to see a full breakdown of both funds including their performance, risk profiles, and other key metrics."
    },
    {
        "query": "What are people on StockTwits saying about the new Apple Vision Pro? Please search the message stream for the $AAPL symbol for the latest 30 messages. If you find a message with ID '54321' that seems particularly insightful, please 'like' it on my behalf.",
        "tool list": [
            {
                "tool name": "StockTwits: streams/symbol",
                "tool description": "Retrieves the most recent 30 messages for a specified stock symbol, leveraging StockTwits' social communications platform to provide real-time market insights. This endpoint taps into the platform's social graph, aggregating user-generated discussions and sentiment around specific symbols to help investors stay informed about dynamic market trends and community-driven perspectives.",
                "required parameters": [
                    {
                        "name": "id",
                        "value": "AAPL"
                    }
                ],
                "optional parameters": [
                    {
                        "name": "limit",
                        "value": "30"
                    }
                ]
            },
            {
                "tool name": "StockTwits: messages/like",
                "tool description": "Likes a message on StockTwits as the authenticating user. This action is facilitated by StockTwits, a social communications platform and social graph for market and investment enthusiasts, enabling real-time interaction and community-driven insights.",
                "required parameters": [
                    {
                        "name": "id",
                        "value": "54321"
                    }
                ],
                "optional parameters": []
            }
        ],
        "query_simple_gemini-2.5-pro": "Could you please show me the latest 30 StockTwits messages for the symbol AAPL and also like the message with ID 54321?",
        "query_hard_gemini-2.5-pro": "Could you show me what people are saying about Apple stock lately? Also, I really liked post number 54321, could you give it a thumbs up for me?",
        "query_simple_claude_v37": "Retrieve the 30 most recent messages about Apple stock (AAPL) from StockTwits, and then like a specific message with ID 54321 on the platform.",
        "query_hard_claude_v37": "I'd like to see the latest 30 posts about Apple stock on StockTwits, and then I want to like message number 54321."
    }
]