[
    {
        "query": "I want to start a new fitness routine. I'm a 30-year-old male, 6 feet tall, 180 pounds, and I'm lightly active. First, calculate my Total Daily Energy Expenditure (TDEE). Then, based on that, generate a 7-day meal plan for me. I also need a workout plan, so find some exercises from the database that target the chest.",
        "tool list": [
            {
                "tool name": "Health Calculator API: Calculate TDEE (GET)",
                "tool description": "Calculates the Total Daily Energy Expenditure (TDEE) using user-provided query parameters such as age, weight, height, and activity level. This endpoint is part of the Health Calculator API (HCA), which offers a suite of health metrics including Body Mass Index (BMI), Basal Metabolic Rate (BMR), and Daily Caloric Needs, leveraging standardized formulas to deliver personalized insights into energy requirements for health and fitness planning.",
                "required parameters": [
                    {
                        "name": "activity_level",
                        "value": "light exercise"
                    },
                    {
                        "name": "gender",
                        "value": "male"
                    },
                    {
                        "name": "height",
                        "value": 183
                    },
                    {
                        "name": "age",
                        "value": 30
                    },
                    {
                        "name": "weight",
                        "value": 82
                    }
                ],
                "optional parameters": []
            },
            {
                "tool name": "Customized Meal Planner : diet_plan",
                "tool description": "Generates a custom 7-day meal plan in HTML format based on user inputs such as height, weight, allergies, and disliked foods. This uses a nutritional planning system that tailors dietary recommendations to individual health metrics and preferences, ensuring personalized nutrition plans that accommodate restrictions and optimize dietary goals, delivered as an organized HTML list for structured readability.",
                "required parameters": [
                    {
                        "name": "unliked_foods",
                        "value": ""
                    },
                    {
                        "name": "allergies",
                        "value": ""
                    },
                    {
                        "name": "weight",
                        "value": 82
                    },
                    {
                        "name": "height",
                        "value": 183
                    }
                ],
                "optional parameters": []
            },
            {
                "tool name": "ExerciseDB: List by target muscle",
                "tool description": "Fetches exercises targeting a specific primary muscle by querying a database of 1300+ exercises with detailed data and animated demonstrations. This endpoint leverages ExerciseDB's comprehensive repository to quickly retrieve relevant workouts, enabling users to find targeted strength-training options based on muscle group requirements.",
                "required parameters": [
                    {
                        "name": "target",
                        "value": "chest"
                    }
                ],
                "optional parameters": []
            }
        ],
        "query_simple_gemini-2.5-pro": "I'm a 30-year-old male, 183 cm tall, and weigh 82 kg. I engage in light exercise. Could you calculate my TDEE, create a 7-day meal plan for me (I have no allergies or disliked foods), and also provide a list of exercises targeting the chest?",
        "query_hard_gemini-2.5-pro": "I'm a 30-year-old man, 183 cm tall and weighing 82 kg, looking to improve my fitness. My activity level is pretty light, mostly just a few workouts a week. Could you put together a full 7-day meal plan for me? I'm not a picky eater and have no allergies. On top of that, I'd like to get some suggestions for exercises that target my chest.",
        "query_simple_claude_v37": "Calculate the TDEE for a 30-year-old male who is 183cm tall, weighs 82kg, and does light exercise. Then create a customized 7-day meal plan for someone with these measurements who has no food allergies or dislikes. Finally, provide a list of chest exercises for their workout routine.",
        "query_hard_claude_v37": "I'm a 30-year-old man, 183 cm tall and weighing 82 kg. I do light exercise regularly. Can you calculate how many calories I need daily, create a weekly meal plan for me, and suggest some chest exercises I could do?"
    },
    {
        "query": "I need to book a dentist appointment at the 'Downtown Dental' clinic for next Wednesday afternoon. Can you first check their available appointment times? Once you find an open slot around 2 PM, please book it for me under my name, John Smith.",
        "tool list": [
            {
                "tool name": "Appointment System API: Appointment Time List",
                "tool description": "Retrieves a list of appointment times for a specified date and clinic, indicating availability for each time slot. This endpoint accepts a date and clinic name as parameters, returning a JSON array with details such as time labels (hLabel), hour/minute values, availability status (available), and interval durations (15 or 30 minutes). This functionality is part of the Appointment System API, which manages all clinic-related appointment operations for users and admins. The endpoint leverages the API's backend infrastructure to provide real-time availability data, enabling seamless scheduling by highlighting open slots and avoiding conflicts.",
                "required parameters": [
                    {
                        "name": "date",
                        "value": "2024-11-20"
                    }
                ],
                "optional parameters": [
                    {
                        "name": "clinicName",
                        "value": "Downtown Dental"
                    }
                ]
            },
            {
                "tool name": "Appointment System API: Add Appointment",
                "tool description": "Allows users to schedule an appointment by specifying patient details, date, and time. This is part of an Appointment System API that manages all appointment operations for a clinic, leveraging a centralized database to handle both user and admin workflows, ensuring efficient coordination of medical services.",
                "required parameters": [
                    {
                        "name": "aDay",
                        "value": "2024-11-20"
                    },
                    {
                        "name": "aHour",
                        "value": "{{id for the 2 PM time slot from the previous step}}"
                    },
                    {
                        "name": "aName",
                        "value": "John Smith"
                    },
                    {
                        "name": "aTel",
                        "value": "Not provided"
                    },
                    {
                        "name": "aType",
                        "value": "Dentist Appointment"
                    }
                ],
                "optional parameters": [
                    {
                        "name": "clinicName",
                        "value": "Downtown Dental"
                    }
                ]
            }
        ],
        "query_simple_gemini-2.5-pro": "Please book a Dentist Appointment for John Smith at Downtown Dental for 2 PM on November 20, 2024. His phone number is not provided.",
        "query_hard_gemini-2.5-pro": "Could you see if there's a 2 PM slot available for a dentist appointment at Downtown Dental on November 20th, 2024? If so, please book it for John Smith. I don't have a phone number to provide for him right now.",
        "query_simple_claude_v37": "I need to schedule a dentist appointment for John Smith at Downtown Dental on November 20, 2024, at 2 PM. First, I checked the available appointment times for that date at Downtown Dental, then used the appointment ID for the 2 PM slot to book the appointment. No phone number was provided for John Smith.",
        "query_hard_claude_v37": "I need to book a dental appointment for John Smith at Downtown Dental on November 20th, 2024. Can you check what times are available and schedule a 2 PM slot if possible?"
    },
    {
        "query": "I'm traveling to Brazil next week. Can you get me the latest COVID-19 statistics for the country? Also, I have asthma, so please check the current air quality in Rio de Janeiro.",
        "tool list": [
            {
                "tool name": "Coronavirus monitor: latest_stat_by_country_name",
                "tool description": "Retrieves the most recent coronavirus statistics for a specified country according to the input country name. This endpoint is part of a quick and easy API that has been operational for over a year, aggregating data from reliable sources to provide timely insights. As one of the first coronavirus APIs on this platform, it ensures accurate, up-to-date information is accessible to support informed decision-making during public health crises.",
                "required parameters": [
                    {
                        "name": "country",
                        "value": "Brazil"
                    }
                ],
                "optional parameters": []
            }
        ],
        "query_simple_gemini-2.5-pro": "What are the most recent coronavirus statistics for Brazil?",
        "query_hard_gemini-2.5-pro": "Can you give me an update on the COVID-19 situation in Brazil?",
        "query_simple_claude_v37": "What are the latest COVID-19 statistics for Brazil? Please provide me with the most recent coronavirus data available for this country.",
        "query_hard_claude_v37": "What are the latest COVID-19 statistics for Brazil?"
    },
    {
        "query": "I need to find a cardiologist in my area. Can you look up the doctor with the NPI number 1234567890 to get their details? Also, my previous doctor gave me the diagnosis code 'I50.9'; can you tell me what that ICD-10 code means?",
        "tool list": [
            {
                "tool name": "US Doctors and Medical Professionals: /search_npi?npi=[NPI Number]",
                "tool description": "Searches for medical professionals using an NPI number. This is part of the US Doctors and Medical Professionals Database API, which leverages a comprehensive database of NPI numbers to provide accurate information about healthcare providers, enabling efficient and reliable lookup of medical professionals.",
                "required parameters": [
                    {
                        "name": "npi",
                        "value": "1234567890"
                    }
                ],
                "optional parameters": []
            },
            {
                "tool name": "ICD10: Search",
                "tool description": "Searches for medical information using a code or descriptive term. This utilizes the ICD-10 classification system, drawing from a comprehensive database of medical codes to accurately retrieve diagnoses, procedures, or symptoms, enabling healthcare professionals to ensure precise coding and documentation.",
                "required parameters": [
                    {
                        "name": "search",
                        "value": "I50.9"
                    }
                ],
                "optional parameters": []
            }
        ],
        "query_simple_gemini-2.5-pro": "Find the medical professional with NPI number 1982606822 and also provide the description for the ICD-10 code I50.9.",
        "query_hard_gemini-2.5-pro": "Could you please look up the doctor whose NPI number is 1234567890? I'd also like to know what the medical code I50.9, which was on my recent bill, refers to.",
        "query_simple_claude_v37": "Search for information about a medical professional with NPI number 1234567890 and look up the ICD-10 code I50.9",
        "query_hard_claude_v37": "Can you look up the doctor with NPI number 1234567890 and tell me what the medical code I50.9 means? I need to understand this diagnosis code from my medical record."
    },
    {
        "query": "I was using the 'WellTrack' app to monitor my health, but I've decided to switch to a new service. I no longer want WellTrack to have access to my medical data. Please go into my Flexpa account and revoke the access token for that application to ensure my data is secure.",
        "tool list": [
            {
                "tool name": "Flexpa: RevokeToken",
                "tool description": "Revokes an access token to terminate active sessions or permissions. This endpoint is part of the Flexpa digital health API, which enables patients and health plan members to access, manage, and control access to their medical records. By leveraging OAuth 2.0 token management, it ensures secure authentication workflows, allowing developers to programmatically invalidate tokens once an app is authenticated, as outlined in Flexpa's developer documentation.",
                "required parameters": [
                    {
                        "name": "Authorization",
                        "value": "the access token associated with the 'WellTrack' app"
                    }
                ],
                "optional parameters": []
            }
        ],
        "query_simple_gemini-2.5-pro": "Please terminate the active session for the 'WellTrack' app by revoking its access token.",
        "query_hard_gemini-2.5-pro": "I'm done using the WellTrack app, please remove its connection to my health account.",
        "query_simple_claude_v37": "Revoke the WellTrack app's access token to terminate its active session and remove its permissions to access my medical records through the Flexpa digital health API",
        "query_hard_claude_v37": "I need to log out of the WellTrack app that's accessing my health records. Can you help me disconnect it so it no longer has access to my medical information?"
    },
    {
        "query": "I want a more detailed look at my body composition and health risks. Can you calculate my Waist-to-Hip Ratio (WHR) and my A Body Shape Index (ABSI)? Based on the ABSI result, please also tell me my estimated mortality risk status.",
        "tool list": [
            {
                "tool name": "Mega Fitness Calculator: Get Waist–Hip ratio (WHR)",
                "tool description": "Calculates Waist-Hip Ratio (WHR) to assess fat distribution and determine health risk levels (Low, Moderate, High) based on waist and hip measurements. This endpoint is part of a unified API offering seven fitness calculators, including Body Fat Percentage and BMI, providing comprehensive health insights through standardized metrics and categorizations like Pear and Apple body shapes.",
                "required parameters": [
                    {
                        "name": "waist",
                        "value": "<your_waist_circumference>"
                    },
                    {
                        "name": "gender",
                        "value": "<your_gender>"
                    },
                    {
                        "name": "hip",
                        "value": "<your_hip_circumference>"
                    }
                ],
                "optional parameters": []
            },
            {
                "tool name": "Mega Fitness Calculator: Get A Body Shape Index (ABSI)",
                "tool description": "Calculates mortality risk status based on health factors, categorizing results into Very Low, Low, Average, High, or Very High. This endpoint is part of a parent tool offering seven fitness calculators via a single API, including ABSI, BMI, TDEE, BMR, ideal body weight, waist-hip ratio, and body fat percentage, enabling comprehensive health assessments through integrated metrics.",
                "required parameters": [
                    {
                        "name": "gender",
                        "value": "<your_gender>"
                    },
                    {
                        "name": "height",
                        "value": "<your_height_in_cm>"
                    },
                    {
                        "name": "age",
                        "value": "<your_age_in_years>"
                    },
                    {
                        "name": "waist",
                        "value": "<your_waist_circumference_in_cm>"
                    },
                    {
                        "name": "weight",
                        "value": "<your_weight_in_kg>"
                    }
                ],
                "optional parameters": []
            }
        ],
        "query_simple_gemini-2.5-pro": "I am a 35-year-old male who is 180 cm tall and weighs 85 kg. My waist circumference is 95 cm. What is my mortality risk status?",
        "query_hard_gemini-2.5-pro": "I'm a 35-year-old man and I'm trying to get a better handle on my health. I am 180 cm tall and weigh 85 kg. My waist is 90 cm and my hips are 100 cm. Based on my measurements, could you first tell me about my body shape and the associated health risks? And then, could you also give me a broader assessment of my overall health outlook?",
        "query_simple_claude_v37": "I want to assess my body shape and health risk using both Waist-Hip Ratio (WHR) and A Body Shape Index (ABSI). For WHR, I need to input my waist circumference, gender, and hip circumference to determine if I have an apple or pear body shape and my associated health risk level (Low, Moderate, or High). Then, I want to calculate my ABSI score by providing my gender, height in cm, age in years, waist circumference in cm, and weight in kg to determine my mortality risk status (Very Low, Low, Average, High, or Very High). These calculations will give me a comprehensive understanding of my body composition and health risks.",
        "query_hard_claude_v37": "I'm a 42-year-old male trying to understand my health risks. My measurements are: 85 cm waist circumference, 95 cm hip circumference, 178 cm tall, and I weigh 76 kg. Can you tell me about my body shape and mortality risk based on these measurements?"
    }
]